docs/comp-sci/functional-lang.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Statically-Typed Functional Languages</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Statically-Typed Functional Languages</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-bad31a31-f627-4de0-b7c9-dbe712e888c2">1. Introduction</a>
<ul>
<li><a href="#h-5c4e0c0e-eedc-4802-bc43-74642393fcd9">1.1. What are "algebraic data types"?</a></li>
</ul>
</li>
<li><a href="#h-b20aaf69-4fb7-4614-a19a-442edd5a9f74">2. GHC Core</a>
<ul>
<li><a href="#h-d55708ac-878a-42f2-b451-31ec087fed7e">2.1. Prenex Polymorphism</a></li>
</ul>
</li>
<li><a href="#h-4c425055-f94d-4575-817f-44ea5d738e90">3. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-bad31a31-f627-4de0-b7c9-dbe712e888c2" class="outline-2">
<h2 id="h-bad31a31-f627-4de0-b7c9-dbe712e888c2"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-bad31a31-f627-4de0-b7c9-dbe712e888c2">
<p>
Statically-typed functional programming languages appear to be
variations on a theme with slight differences among syntax. One way to
derive statically-typed functional languages is:
</p>

<ol class="org-ol">
<li>Start with a typed lambda-calculus</li>
<li>Add algebraic data types</li>
</ol>

<p>
This will give the "floor model" of such languages, then we can add more
bells and whistles and syntactic sugar.
</p>
</div>
<div id="outline-container-h-5c4e0c0e-eedc-4802-bc43-74642393fcd9" class="outline-3">
<h3 id="h-5c4e0c0e-eedc-4802-bc43-74642393fcd9"><span class="section-number-3">1.1.</span> What are "algebraic data types"?</h3>
<div class="outline-text-3" id="text-h-5c4e0c0e-eedc-4802-bc43-74642393fcd9">
<p>
I have not found a rigorous definition anywhere, but a suitable
implementation of algebraic data types requires the following:
</p>

<ol class="org-ol">
<li>Iso-recursive types</li>
<li>Variant types</li>
<li>Product ("tuple") types</li>
</ol>

<p>
What's an "iso-recursive type"? Well, recursive types are formalized
using a new binder (&mu;) with a type variable \(X\). This is called the
<dfn>Fixpoint Type Constructor</dfn>.
</p>

<p>
We then have two
functions
</p>

<ul class="org-ul">
<li>\(\mathrm{unfold}\colon\mu X.\tau\to\tau[(\mu X.\tau)/X]\)
where \(\tau[(\mu X.\tau)/X]\) is obtained by replacing all free
instances of \(X\) by \(\mu X.\tau\), and</li>
<li>\(\mathrm{fold}\colon\tau[(\mu X.\tau)/X]\to\mu X.\tau\)</li>
</ul>

<p>
Such that
</p>

<ol class="org-ol">
<li>\(\mathrm{fold}\circ\mathrm{unfold}=\mathrm{id}_{\mu X.\tau}\) is the
identity function, and</li>
<li>\(\mathrm{unfold}\circ\mathrm{fold}=\mathrm{id}_{\tau[(\mu X.\tau)/X]}\)
is the identity function.</li>
</ol>

<p>
An algebraic data type is then a variant, each branch being a product
type (possibly recursive). For example, a list:
</p>

<ul class="org-ul">
<li>Type definition: \(\tau~\mathrm{list} = \mu X.(\mathbf{1} + (\tau\times X))\)
<ul class="org-ul">
<li>Technically, we have it be \(\forall\tau.\mu X.(\mathbf{1} + (\tau\times X))\)</li>
<li>Haskell swaps \(\mu\) and \(\forall\) binders, confusingly enough</li>
</ul></li>
<li>Constructors:
<ol class="org-ol">
<li>\(\mathrm{nil}_{\tau} = \mathrm{fold}_{\tau~\mathrm{list}}(\mathrm{injl~unit})\)</li>
<li>\(\mathrm{cons}_{\tau} = \lambda x{:}\tau.\lambda\ell{:}\tau~\mathrm{list}.\mathrm{fold}_{\tau~\mathrm{list}}~\mathrm{injr}(x,\ell)\)</li>
</ol></li>
<li>Pattern matching (destructuring, etc.) then uses "unfold",
specifically
\(\lambda\ell{:}\tau~\mathrm{list}.\mathrm{case}~(\mathrm{unfold}_{\tau~\mathrm{list}}\ell)~\mathrm{of}\dots\)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-b20aaf69-4fb7-4614-a19a-442edd5a9f74" class="outline-2">
<h2 id="h-b20aaf69-4fb7-4614-a19a-442edd5a9f74"><span class="section-number-2">2.</span> GHC Core</h2>
<div class="outline-text-2" id="text-h-b20aaf69-4fb7-4614-a19a-442edd5a9f74">
<p>
We can write a minimal functional language using System F, which is what
Haskell does with its intermediate Core language:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Expr</span>
  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Var</span> <span class="org-haskell-constructor">Var</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Lit</span> <span class="org-haskell-constructor">Literal</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">App</span> <span class="org-haskell-constructor">Expr</span> <span class="org-haskell-constructor">Expr</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Lam</span> <span class="org-haskell-constructor">Var</span> <span class="org-haskell-constructor">Expr</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Both term and type lambda</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Let</span> <span class="org-haskell-constructor">Bind</span> <span class="org-haskell-constructor">Expr</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Case</span> <span class="org-haskell-constructor">Expr</span> <span class="org-haskell-constructor">Var</span> <span class="org-haskell-constructor">Type</span> [(<span class="org-haskell-constructor">AltCon</span>, [<span class="org-haskell-constructor">Var</span>], <span class="org-haskell-constructor">Expr</span>)]
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Type</span> <span class="org-haskell-constructor">Type</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Used for type application</span>

<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Var</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Id</span> <span class="org-haskell-constructor">Name</span> <span class="org-haskell-constructor">Type</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Term variable</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">TyVar</span> <span class="org-haskell-constructor">Name</span> <span class="org-haskell-constructor">Kind</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Type/kind variable</span>

<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">Kind</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-type">Type</span>

<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Type</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TyVarTy</span> <span class="org-haskell-constructor">Var</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">LitTy</span> <span class="org-haskell-constructor">TyLit</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">AppTy</span> <span class="org-haskell-constructor">Type</span> <span class="org-haskell-constructor">Type</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">TyConApp</span> <span class="org-haskell-constructor">TyCon</span> [<span class="org-haskell-constructor">Type</span>]
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">FunTy</span> <span class="org-haskell-constructor">Type</span> <span class="org-haskell-constructor">Type</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Not really necy</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">ForAllTy</span> <span class="org-haskell-constructor">Var</span> <span class="org-haskell-constructor">Type</span>
</pre>
</div>
</div>
<div id="outline-container-h-d55708ac-878a-42f2-b451-31ec087fed7e" class="outline-3">
<h3 id="h-d55708ac-878a-42f2-b451-31ec087fed7e"><span class="section-number-3">2.1.</span> Prenex Polymorphism</h3>
<div class="outline-text-3" id="text-h-d55708ac-878a-42f2-b451-31ec087fed7e">
<p>
We actually don't need "full" System F. We can restrict attention to
rank-1 polymorphism, where the &forall; and big &Lambda; binders appear in
"prenex form" (i.e., outermost position). So, we can write:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-keyword">data</span> <span class="org-haskell-type">MonoType</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TyVarTy</span> <span class="org-haskell-constructor">Var</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">LitTy</span> <span class="org-haskell-constructor">TyLit</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">AppTy</span> <span class="org-haskell-constructor">MonoType</span> <span class="org-haskell-constructor">MonoType</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">TyConApp</span> <span class="org-haskell-constructor">TyCon</span> [<span class="org-haskell-constructor">MonoType</span>]
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">FunTy</span> <span class="org-haskell-constructor">MonoType</span> <span class="org-haskell-constructor">MonoType</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Not really necy</span>
<span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Type</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">TSType</span> <span class="org-haskell-constructor">MonoType</span>
  <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">ForAllTy</span> <span class="org-haskell-constructor">Var</span> <span class="org-haskell-constructor">TypeScheme</span>
</pre>
</div>

<p>
Or something like that.
</p>

<p>
This will have decidable type checking, whereas System F does not have
decidable type checking (it's known to be undecidable).
</p>
</div>
</div>
</div>
<div id="outline-container-h-4c425055-f94d-4575-817f-44ea5d738e90" class="outline-2">
<h2 id="h-4c425055-f94d-4575-817f-44ea5d738e90"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-h-4c425055-f94d-4575-817f-44ea5d738e90">
<ul class="org-ul">
<li>Simon Peyton Jones,<br>
"Into the Core: Squeezing Haskell into Nine Constructors".<br>
<a href="https://youtu.be/uR_VzYxvbxg">2016 talk</a> and <a href="https://youtu.be/Gml1m-3L47s">2022 talk</a>
<ul class="org-ul">
<li>Talks about making a minimal functional language atop System F.</li>
</ul></li>
<li>Lecture notes on recursive types; CS Cornell Fall 2012 course 4110
<a href="https://www.cs.cornell.edu/courses/cs4110/2012fa/lectures/lecture27.pdf">PDF</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Fri, 22 Jul 2022 12:36:18 -0700
</div>
</body>
</html>
